---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.GridCount
source: html/7348c6d0-75cb-d635-5b21-c8a7110c2988.htm
---
# Autodesk.Revit.DB.FillPattern.GridCount Property

Gets the count of the fill grids in this fill pattern.

## Syntax (C#)
```csharp
public int GridCount { get; }
```